Terraform Plan:

https://github.com/connormaglynn/infrastructure/pull/44/checks#step:5:1

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/connormaglynn/github/runs/run-nLowEkqQT2UWDvX2

Waiting for the plan to start...

Terraform v1.6.6
on linux_amd64
Initializing plugins and modules...
github_repository.repositories["scripts"]: Refreshing state... [id=scripts]
github_repository.repositories["imust-cli"]: Refreshing state... [id=imust-cli]
github_repository.repositories["projects"]: Refreshing state... [id=projects]
github_repository.repositories["advent-of-code-typescript"]: Refreshing state... [id=advent-of-code-typescript]
github_repository.repositories["learning-golang"]: Refreshing state... [id=learning-golang]
github_repository.repositories["connorglynn.com"]: Refreshing state... [id=connorglynn.com]
github_repository.repositories["typescript-template"]: Refreshing state... [id=typescript-template]
github_repository.repositories["developer-navigation-browser-plugin"]: Refreshing state... [id=developer-navigation-browser-plugin]
github_repository.repositories["shopping-cart-typescript"]: Refreshing state... [id=shopping-cart-typescript]
github_repository.repositories["gemsbook-keeping.co.uk"]: Refreshing state... [id=gemsbook-keeping.co.uk]
github_repository.repositories["learning-python"]: Refreshing state... [id=learning-python]
github_repository.repositories["infrastructure"]: Refreshing state... [id=infrastructure]
github_repository.repositories["tillysofcastleton.com"]: Refreshing state... [id=tillysofcastleton.com]
github_repository.repositories["garrettys.com"]: Refreshing state... [id=garrettys.com]
github_repository.repositories["firebase-playground"]: Refreshing state... [id=firebase-playground]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.repositories["save-pinned-tabs-browser-plugin"] will be created
  + resource "github_repository" "repositories" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = false
      + allow_squash_merge          = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "This repository is managed in Terraform"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "save-pinned-tabs-browser-plugin"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "browser-extension",
          + "chrome-extension",
          + "github-actions",
        ]
      + visibility                  = "public"
      + web_commit_signoff_required = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost estimation:

Waiting for cost estimate to complete...

Cost estimation:

Resources: 0 of 16 estimated
           $0.0/mo +$0.0

```